from data import db_session
from data.section import Section


def seed():
    db = db_session.create_session()
    sections = {'Русская музыка': ['Описание Описание Описание Описание Описание Описание Описание', 'russian_music'],
                'Зарубежная музыка': ['Описание Описание Описание Описание Описание Описание', 'foreign_music'],
                'Cтихи | поэзия': ['Описание Описание Описание Описание Описание Описание Описание', 'poetry'],
                'Олдскул': ['Описание Описание Описание Описание Описание Описание Описание Описание', 'oldschool'],
                'Фрешмены': ['Описание Описание Описание Описание Описание Описание Описание Описание', 'freshmen'],
                'Битмейкинг': ['Описание Описание Описание Описание Описание Описание Описание Описание', 'beatmaking'],
                'Мероприятия': ['Описание Описание Описание Описание Описание Описание Описание Описание', 'events'],
                'Вопросы новичков': ['Описание Описание Описание Описание Описание Описание', 'novice_questions'],
                'Флуд': ['Описание Описание Описание Описание Описание Описание Описание Описание Описание', 'flood'],
                'Остальное': ['Описание', 'other']
                }
    for name, arguments in sections.items():
        description, address = arguments[0], arguments[1]
        section = Section(name=name, description=description, address=address)
        db.add(section)
    db.commit()
